notes/GA/2012-01-10.org
Occupy Seattle General Assembly, 2012-01-10

Minutes taken by David Lindes.

* Orientation

Wording notes are not on hand, so improvised.

For future reference, they're at
http://occupyseattle.org/document/general-assembly

* Introductions of new people

- Bang -- new to being on time
- Jackie -- is new.

* Workers Reports

[This is a new section, for people who work, or used to, reporting
about that.]

- One report about a firing, suspected of being gender-based.
  Suggestion to reach out to the Seattle Solidarity Group.

- Someone from Mental Health and Chemical Abuse Division... (sorry,
  details missed.)

* Work Group Reports

** Court Solidarity, Duff

Friday, January 13th.  1:30pm. Seattle Municipal Court, Room number 1103.

One of our Brothers, Ed Mast, has a court date, stemming from his
arrest on October 5th.  You may remember October 5th.  It was the
first police raid on our camp at Westlake.  The police raided us with
violence and horses.  32 of us were arrested.  Ed's date is 1:30 this
Friday.  Courtroom 1103.  He does not have any more information about
his co-arrestees from October 5th.  Some of them may have been
arrested and never charged, in the classic cop technique of crowd
control by arresting with no intent of charges.  However if any of you
have other information about other October 5th arrestees, please
contact Duff.

October 5th was a significant day.  It showed what Chief Diaz and
Mayor Mike McGinn think of the Occupy Movement.  We were one of the
very first occupations to have been violently raided.  We need to come
out en masse on Friday.

** John, Civil Disobedience Workgroup

First meeting will be on Monday, here, 6pm.  Everybody come.

** Community over Capital working group

It is a continuation of the revolutionary spirit of the 10th and Union
warehouse occupation.  They are working on still reclaiming that
warehouse, and addressing the multi-family tax exemption program,
which is an extremely corrupt city program, and discussing how to
organize our physical landscape, so that we are more connected to each
other.  All the information is online.

First meeting is Sunday, at 5pm, here.

** Rise and De-colonize

Working with the United Farmworkers on two dates:

*** National Day of Latina Activists, January 20th

*** January 28th, Days of Action, down the coast, against Dairigold

Against the farmers that abuse their workers, in almost 3rd-world
conditions.  Flyer is coming.

This is an escalation to a national day of May Day general strike.

** Gender Equality Caucus

Meeting this Sunday, 11am, at Bauhaus

They've started planning an all-day teach-in.  They're currently
researching topics and speakers.  Topics so far include:

- The Gender Binary (linking with Culture Jamming)
- Reproductive Oppression
- Human Trafficking and Anti-Slavery
- and more!

If you have suggestions and can't come, please let Kristin know about
speakers.

* Action Announcements

** Guantanimo Protest

from Greg Spense Wolf

Tomorrow, at the Jackson Federal Building, 2nd Avenue, Marion and
Madison:

Silent Vigil, 5-6pm.  Protesting Guantanimo prisoners and indefinite
intention.  Organized by Amnesty International, Code Pink, and ...

At 6pm, Occupy is marching to Obama's headquarters, and reading
Guantanimo stories in Jumpsuits.

** MLK Speech

Thursday, day after tomorrow, at 3rd and University, where Garden of
Rememberence is, they're going to be listening to a Martin Luther King
speech, "Where do we go from here?" from 1967.  It's a great speech.
And unfortunately the MLK event inside, which is one of the King
County events, cannot play any of the speeches, because the company
who owns the right to the speeches, charges a lot of money.  So
they've organized this event outside the building, where the recording
will be played, and anyone who'd like to listen, please come and join
the crowd.

11:30-1pm, 3rd and University.  Thursday, 2012-01-12.

** Bring Diaz Down

Campaign is having a march, this coming Saturday, 2012-01-14.  It's
going to be in part a speak-out about police brutality.  And the other
half will be a torch-light march.  They're awesome.

It's going to start at 23rd and Union, at 4pm, on Saturday.  Then
they'll march to the East Precinct in Capitol Hill.  There they'll
have another speak-out.

The torches only last 20 minutes, so they will light them as they're
cresting the hill, about Madison and Pike, and come down in force,
with them all lit.

If you come, please be aware, the flames get really big.  So please
provide enough space between you and the next person.

This is in support of the call for the resignation of Seattle Police
chief John Diaz.

* Pre-proposals

Announcements of proposals to be voted on at a future GA.

None heard.

