notes/GA/2012-01-10.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Occupy Seattle General Assembly, 2012-01-10</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Occupy Seattle General Assembly, 2012-01-10"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-10 21:39:53 PST"/>
<meta name="author" content="David Lindes"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Occupy Seattle General Assembly, 2012-01-10</h1>

<p>Minutes taken by David Lindes.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Orientation</a></li>
<li><a href="#sec-2">2 Introductions of new people</a></li>
<li><a href="#sec-3">3 Workers Reports</a></li>
<li><a href="#sec-4">4 Work Group Reports</a>
<ul>
<li><a href="#sec-4-1">4.1 Court Solidarity, Duff</a></li>
<li><a href="#sec-4-2">4.2 John, Civil Disobedience Workgroup</a></li>
<li><a href="#sec-4-3">4.3 Community over Capital working group</a></li>
<li><a href="#sec-4-4">4.4 Rise and De-colonize</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1 National Day of Latina Activists, January 20th</a></li>
<li><a href="#sec-4-4-2">4.4.2 January 28th, Days of Action, down the coast, against Dairigold</a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5 Gender Equality Caucus</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Action Announcements</a>
<ul>
<li><a href="#sec-5-1">5.1 Guantanimo Protest</a></li>
<li><a href="#sec-5-2">5.2 MLK Speech</a></li>
<li><a href="#sec-5-3">5.3 Bring Diaz Down</a></li>
</ul>
</li>
<li><a href="#sec-6">6 Pre-proposals</a></li>
<li><a href="#sec-7">7 Discussion</a>
<ul>
<li><a href="#sec-7-1">7.1 Sharing from discussions</a>
<ul>
<li><a href="#sec-7-1-1">7.1.1 Accountability GA group</a></li>
<li><a href="#sec-7-1-2">7.1.2 random stuff&hellip;</a></li>
<li><a href="#sec-7-1-3">7.1.3 New blood for facilitation</a></li>
<li><a href="#sec-7-1-4">7.1.4 Open Question:</a></li>
<li><a href="#sec-7-1-5">7.1.5 Semantics</a></li>
<li><a href="#sec-7-1-6">7.1.6 follow-up on facilitation</a></li>
<li><a href="#sec-7-1-7">7.1.7 meta point:</a></li>
<li><a href="#sec-7-1-8">7.1.8 how we feel about it</a></li>
<li><a href="#sec-7-1-9">7.1.9 Change facilitators mid-GA?</a></li>
<li><a href="#sec-7-1-10">7.1.10 more discussion&hellip;</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-8">8 Announcements</a>
<ul>
<li><a href="#sec-8-1">8.1 23rd and Alder: Still there.</a></li>
<li><a href="#sec-8-2">8.2 UW's first GA</a></li>
<li><a href="#sec-8-3">8.3 Moving&hellip;</a></li>
</ul>
</li>
<li><a href="#sec-9">9 Song</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Orientation</h2>
<div class="outline-text-2" id="text-1">


<p>
Wording notes are not on hand, so improvised.
</p>
<p>
For future reference, they're at
<a href="http://occupyseattle.org/document/general-assembly">http://occupyseattle.org/document/general-assembly</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introductions of new people</h2>
<div class="outline-text-2" id="text-2">


<ul>
<li>Bang &ndash; new to being on time
</li>
<li>Jackie &ndash; is new.
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Workers Reports</h2>
<div class="outline-text-2" id="text-3">


<p>
[This is a new section, for people who work, or used to, reporting
about that.]
</p>
<ul>
<li>One report about a firing, suspected of being gender-based.
  Suggestion to reach out to the Seattle Solidarity Group.

</li>
<li>Someone from Mental Health and Chemical Abuse Division&hellip; (sorry,
  details missed.)
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Work Group Reports</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Court Solidarity, Duff</h3>
<div class="outline-text-3" id="text-4-1">


<p>
Friday, January 13th.  1:30pm. Seattle Municipal Court, Room number 1103.
</p>
<p>
One of our Brothers, Ed Mast, has a court date, stemming from his
arrest on October 5th.  You may remember October 5th.  It was the
first police raid on our camp at Westlake.  The police raided us with
violence and horses.  32 of us were arrested.  Ed's date is 1:30 this
Friday.  Courtroom 1103.  He does not have any more information about
his co-arrestees from October 5th.  Some of them may have been
arrested and never charged, in the classic cop technique of crowd
control by arresting with no intent of charges.  However if any of you
have other information about other October 5th arrestees, please
contact Duff.
</p>
<p>
October 5th was a significant day.  It showed what Chief Diaz and
Mayor Mike McGinn think of the Occupy Movement.  We were one of the
very first occupations to have been violently raided.  We need to come
out en masse on Friday.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> John, Civil Disobedience Workgroup</h3>
<div class="outline-text-3" id="text-4-2">


<p>
First meeting will be on Monday, here, 6pm.  Everybody come.
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Community over Capital working group</h3>
<div class="outline-text-3" id="text-4-3">


<p>
It is a continuation of the revolutionary spirit of the 10th and Union
warehouse occupation.  They are working on still reclaiming that
warehouse, and addressing the multi-family tax exemption program,
which is an extremely corrupt city program, and discussing how to
organize our physical landscape, so that we are more connected to each
other.  All the information is online.
</p>
<p>
First meeting is Sunday, at 5pm, here.
</p>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Rise and De-colonize</h3>
<div class="outline-text-3" id="text-4-4">


<p>
Working with the United Farmworkers on two dates:
</p>

</div>

<div id="outline-container-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> National Day of Latina Activists, January 20th</h4>
<div class="outline-text-4" id="text-4-4-1">


</div>

</div>

<div id="outline-container-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> January 28th, Days of Action, down the coast, against Dairigold</h4>
<div class="outline-text-4" id="text-4-4-2">


<p>
Against the farmers that abuse their workers, in almost 3rd-world
conditions.  Flyer is coming.
</p>
<p>
This is an escalation to a national day of May Day general strike.
</p>
</div>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Gender Equality Caucus</h3>
<div class="outline-text-3" id="text-4-5">


<p>
Meeting this Sunday, 11am, at Bauhaus
</p>
<p>
They've started planning an all-day teach-in.  They're currently
researching topics and speakers.  Topics so far include:
</p>
<ul>
<li>The Gender Binary (linking with Culture Jamming)
</li>
<li>Reproductive Oppression
</li>
<li>Human Trafficking and Anti-Slavery
</li>
<li>and more!
</li>
</ul>


<p>
If you have suggestions and can't come, please let Kristin know about
speakers.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Action Announcements</h2>
<div class="outline-text-2" id="text-5">



</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Guantanimo Protest</h3>
<div class="outline-text-3" id="text-5-1">


<p>
from Greg Spense Wolf
</p>
<p>
Tomorrow, at the Jackson Federal Building, 2nd Avenue, Marion and
Madison:
</p>
<p>
Silent Vigil, 5-6pm.  Protesting Guantanimo prisoners and indefinite
intention.  Organized by Amnesty International, Code Pink, and &hellip;
</p>
<p>
At 6pm, Occupy is marching to Obama's headquarters, and reading
Guantanimo stories in Jumpsuits.
</p>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> MLK Speech</h3>
<div class="outline-text-3" id="text-5-2">


<p>
Thursday, day after tomorrow, at 3rd and University, where Garden of
Rememberence is, they're going to be listening to a Martin Luther King
speech, "Where do we go from here?" from 1967.  It's a great speech.
And unfortunately the MLK event inside, which is one of the King
County events, cannot play any of the speeches, because the company
who owns the right to the speeches, charges a lot of money.  So
they've organized this event outside the building, where the recording
will be played, and anyone who'd like to listen, please come and join
the crowd.
</p>
<p>
11:30-1pm, 3rd and University.  Thursday, 2012-01-12.
</p>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Bring Diaz Down</h3>
<div class="outline-text-3" id="text-5-3">


<p>
Campaign is having a march, this coming Saturday, 2012-01-14.  It's
going to be in part a speak-out about police brutality.  And the other
half will be a torch-light march.  They're awesome.
</p>
<p>
It's going to start at 23rd and Union, at 4pm, on Saturday.  Then
they'll march to the East Precinct in Capitol Hill.  There they'll
have another speak-out.
</p>
<p>
The torches only last 20 minutes, so they will light them as they're
cresting the hill, about Madison and Pike, and come down in force,
with them all lit.
</p>
<p>
If you come, please be aware, the flames get really big.  So please
provide enough space between you and the next person.
</p>
<p>
This is in support of the call for the resignation of Seattle Police
chief John Diaz.
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Pre-proposals</h2>
<div class="outline-text-2" id="text-6">


<p>
Announcements of proposals to be voted on at a future GA.
</p>
<p>
None heard.
</p>
</div>

</div>
