notes/GA/2012-01-10.org
* Discussion

Call for topics for discussion in a small group:

- New Blood for Facilitation Group
- A visit to 9 occupies all up and down the coast; discussing
  coordination options, etc.
- Accountability General Assembly, which was a pre-proposal last week,
  to devote one of the discussion GAs to talking about Accountability
  and mutual support.

-----
breaking at 2012-01-10, 19:42
-----

** Sharing from discussions

In the group that you were in, was there:

- something that made your heart sing
- something disgusting
- something inspiring
- ... ?

*** Accountability GA group

Only two people, and they'd really like more input.

Transformative Justice, which is an alternative model to the existing
justice system, to address conflict in a way that's in line with our
current values.  Community-based accountability, rather than a
punitive system of justice.

*** random stuff...

He was in the military for a long time, and under the impression that
the united states was this giant protector of peoples' rights.  He
spent a lot of time away from his family; spent a lot of time on the
seas.  Now this NDAA act, and the authorization to use military force,
and the Patriot Act has been expanded, and it violates our basic
rights, that so many millions of Americans have died in these wars,
promoting these rights.  He doesn't want to sit around and let it be
taken away.  It pisses him off.

The other issue was foreclosures on all the homeless people.  That's
why on Thursday, they're having a march on Occidental, WaMu theatre
area, it's on the calendar.  The banks are pulling a fast one, trying
to get people to bring their deeds in, and modify their loans.  They
can't even tell people where their check is going -- if any money at
all is even going to the account number that's on the check.

*** New blood for facilitation

It seems like such a dry area, and it is somewhat dry, however, it's a
great opportunity for more of us to get involved in the meetings, and
show greater variety.

What she wants to do as a new helper for facilitation is to invite
people to facility with her, particularly other women, people who are
not white, people of color.  It would be awkward for her to approach
people she doesn't know to ask them to facilitate, and it may be
awkward to be approached by someone you don't know.  Let's have more
of us doing it, and take turns.

Direct response: It will also make more capacity for facilitation if
like workgroups take on facilitation for GAs.  Some groups have talked
about doing this.  This might be a way to allow more people building
the skills, and bringing the content of their workgroup to the broader
community.

Further response: The reason that some facilitators are stepping back
is to make a space for this to happen.  This movement is not
"leaderless", it's "leaderfull" -- here's an opportunity for training
of leadership.

*** Open Question:

Because we constantly have, and keep having, debates about
non-violence versus diversity of tactics -- which effects people
differently based on their life experiences and background:

Will the positive of having someone in facilitation outweigh the
negative of having facilitators not have a voice in the GA?

*** Semantics

An opinion that we should be leaderless, rather than leaderfull.
People come off as a leader, so they end up being a leader by default,
they get seen as a leader...

*** follow-up on facilitation

He hates facilitating, he's done it a couple times, this is the first
time he's come to a discussion GA.  He doesn't like to
facilitate... and can understand why someone who wasn't sure that
their point of view would be heard as a facilitator.

Maybe we could amend the current system so that facilitators do have
a way to get on stack, so we don't have to have a binary thing of
facilitating versus having the ability to get on stack.

*** meta point:

If that question is a real question, it shows how under-represented
certain populations are here.

*** how we feel about it

It's not only that people of color are under-represented, it's how we
think about it.  The fact that we're saying this is part of the
problem.

She hates the idea of anybody's voice being silenced.  She'd like for
everybody to have a chance to have something to say.

*** Change facilitators mid-GA?

One suggestion for a way to maybe have it not be locked.

