notes/GA/2012-01-10.html

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Discussion</h2>
<div class="outline-text-2" id="text-7">


<p>
Call for topics for discussion in a small group:
</p>
<ul>
<li>New Blood for Facilitation Group
</li>
<li>A visit to 9 occupies all up and down the coast; discussing
  coordination options, etc.
</li>
<li>Accountability General Assembly, which was a pre-proposal last week,
  to devote one of the discussion GAs to talking about Accountability
  and mutual support.
</li>
</ul>



<hr/>
<p>
breaking at 2012-01-10, 19:42

</p>
<hr/>


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Sharing from discussions</h3>
<div class="outline-text-3" id="text-7-1">


<p>
In the group that you were in, was there:
</p>
<ul>
<li>something that made your heart sing
</li>
<li>something disgusting
</li>
<li>something inspiring
</li>
<li>&hellip; ?
</li>
</ul>



</div>

<div id="outline-container-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> Accountability GA group</h4>
<div class="outline-text-4" id="text-7-1-1">


<p>
Only two people, and they'd really like more input.
</p>
<p>
Transformative Justice, which is an alternative model to the existing
justice system, to address conflict in a way that's in line with our
current values.  Community-based accountability, rather than a
punitive system of justice.
</p>
</div>

</div>

<div id="outline-container-7-1-2" class="outline-4">
<h4 id="sec-7-1-2"><span class="section-number-4">7.1.2</span> random stuff&hellip;</h4>
<div class="outline-text-4" id="text-7-1-2">


<p>
He was in the military for a long time, and under the impression that
the united states was this giant protector of peoples' rights.  He
spent a lot of time away from his family; spent a lot of time on the
seas.  Now this NDAA act, and the authorization to use military force,
and the Patriot Act has been expanded, and it violates our basic
rights, that so many millions of Americans have died in these wars,
promoting these rights.  He doesn't want to sit around and let it be
taken away.  It pisses him off.
</p>
<p>
The other issue was foreclosures on all the homeless people.  That's
why on Thursday, they're having a march on Occidental, WaMu theatre
area, it's on the calendar.  The banks are pulling a fast one, trying
to get people to bring their deeds in, and modify their loans.  They
can't even tell people where their check is going &ndash; if any money at
all is even going to the account number that's on the check.
</p>
</div>

</div>

<div id="outline-container-7-1-3" class="outline-4">
<h4 id="sec-7-1-3"><span class="section-number-4">7.1.3</span> New blood for facilitation</h4>
<div class="outline-text-4" id="text-7-1-3">


<p>
It seems like such a dry area, and it is somewhat dry, however, it's a
great opportunity for more of us to get involved in the meetings, and
show greater variety.
</p>
<p>
What she wants to do as a new helper for facilitation is to invite
people to facility with her, particularly other women, people who are
not white, people of color.  It would be awkward for her to approach
people she doesn't know to ask them to facilitate, and it may be
awkward to be approached by someone you don't know.  Let's have more
of us doing it, and take turns.
</p>
<p>
Direct response: It will also make more capacity for facilitation if
like workgroups take on facilitation for GAs.  Some groups have talked
about doing this.  This might be a way to allow more people building
the skills, and bringing the content of their workgroup to the broader
community.
</p>
<p>
Further response: The reason that some facilitators are stepping back
is to make a space for this to happen.  This movement is not
"leaderless", it's "leaderfull" &ndash; here's an opportunity for training
of leadership.
</p>
</div>

</div>

<div id="outline-container-7-1-4" class="outline-4">
<h4 id="sec-7-1-4"><span class="section-number-4">7.1.4</span> Open Question:</h4>
<div class="outline-text-4" id="text-7-1-4">


<p>
Because we constantly have, and keep having, debates about
non-violence versus diversity of tactics &ndash; which effects people
differently based on their life experiences and background:
</p>
<p>
Will the positive of having someone in facilitation outweigh the
negative of having facilitators not have a voice in the GA?
</p>
</div>

</div>

<div id="outline-container-7-1-5" class="outline-4">
<h4 id="sec-7-1-5"><span class="section-number-4">7.1.5</span> Semantics</h4>
<div class="outline-text-4" id="text-7-1-5">


<p>
An opinion that we should be leaderless, rather than leaderfull.
People come off as a leader, so they end up being a leader by default,
they get seen as a leader&hellip;
</p>
</div>

</div>

<div id="outline-container-7-1-6" class="outline-4">
<h4 id="sec-7-1-6"><span class="section-number-4">7.1.6</span> follow-up on facilitation</h4>
<div class="outline-text-4" id="text-7-1-6">


<p>
He hates facilitating, he's done it a couple times, this is the first
time he's come to a discussion GA.  He doesn't like to
facilitate&hellip; and can understand why someone who wasn't sure that
their point of view would be heard as a facilitator.
</p>
<p>
Maybe we could amend the current system so that facilitators do have
a way to get on stack, so we don't have to have a binary thing of
facilitating versus having the ability to get on stack.
</p>
</div>

</div>

<div id="outline-container-7-1-7" class="outline-4">
<h4 id="sec-7-1-7"><span class="section-number-4">7.1.7</span> meta point:</h4>
<div class="outline-text-4" id="text-7-1-7">


<p>
If that question is a real question, it shows how under-represented
certain populations are here.
</p>
</div>

</div>

<div id="outline-container-7-1-8" class="outline-4">
<h4 id="sec-7-1-8"><span class="section-number-4">7.1.8</span> how we feel about it</h4>
<div class="outline-text-4" id="text-7-1-8">


<p>
It's not only that people of color are under-represented, it's how we
think about it.  The fact that we're saying this is part of the
problem.
</p>
<p>
She hates the idea of anybody's voice being silenced.  She'd like for
everybody to have a chance to have something to say.
</p>
</div>

</div>

<div id="outline-container-7-1-9" class="outline-4">
<h4 id="sec-7-1-9"><span class="section-number-4">7.1.9</span> Change facilitators mid-GA?</h4>
<div class="outline-text-4" id="text-7-1-9">


<p>
One suggestion for a way to maybe have it not be locked.
</p>
</div>

</div>
