notes/GA/2012-01-10.org
*** more discussion...

- having a process group was originally not about facilitating, but
  about training people to facilitate, and having others do that.
- That doesn't seem to be the current role of the group, and there's
  the thought that it was a pretty solid idea.
- We as an assembly should probably be more pro-active at volunteering
  to facilitate, and the group should be more active in trying to
  recruit people.  Something that everyone needs to just collectively
  work on.
- Idea that we always have at least two facilitators, and so that one
  of them can always raise their hand, and the other facilitator will
  run the process and get them on stack (even if only at the end)
- The job of facilitation is to move the process along, but the more
  people that you have doing that, the easier it is to have people
  coming to it easily.
- The point about taking someone's voice away -- completely
  understood.  But if everyone has to have a point in time when you
  have to check your voice and *don't* get to say something...  Maybe
  that's a useful thing. If more people are open to it and training
  for it, then this will get shared.  We're doing a disservice to some
  of our fellow occupiers by having the same people facilitating every
  night.
- people shouldn't have to choose.  Maybe having more facilitators
  would allow a way for facilitators step up and be speaking.
- There are many people on the team, and people doing agenda,
  time keeper, etc., can speak.  Only two people under the current
  rules can't speak.  But if we amend things so that they can take
  turns, then nobody's voice is unheard.
- One potential problem with the current system is that if you're fine
  with not saying anything one night, but then something comes up in
  the meeting that is highly relevant, then you might want to speak,
  when you'd been fine with facilitating and not speaking previously.
- doesn't always come, wouldn't want to facilitate on the few days
  they do come, because they specifically want to participate in
  something that day.
- so just come more often.  :)
- The point about checking your ego the night you facilitate: there's
  a positive there -- you trust the group enough that even on an issue
  that you care a lot about, that there would be someone there who
  would represent your desires, your philosophy, your interest, in
  balance, ideally, with the multitude of other interests.
- can't honestly see any reason why the facilitators shouldn't be able
  to speak.
- If you're a person who is marginalized, you can't necessarily trust
  that someone will voice what you want to bring up.
- One purpose for keeping people from speaking is to minimize bias in
  who gets to speak.
- there's also a need to recognize that there is an issue of
  capacity.  We have high expectations on the level of commitment for
  most people.  8 GAs a week is a really high level of participation
  -- even those who are highly committed, that's just really hard.
  Perhaps too we need to re-consider the number of meetings that we
  have every week.
- Response to "trusting the assembly"...  This is one of the few times
  he's been able to say this: He looks around the room and doesn't see
  anyone who he strongly distrusts, but usually there are... there are
  people within the group who he really distrusts and doesn't want to
  have them be representing him.  Or even for the people that he does
  trust to truly represent him.  Everyone has unique experiences;
  everyone has a unique role within this movement; etc.  If we're
  talking about something, say, that has to do with police, and one
  person has a different perspective because they just got pepper
  sprayed, or has other history, or whatever, it would be unfortunate
  not just for that person, but for all of us.  There's something to
  be said for trusting people, but he doesn't think trust should ever
  mean that you're giving up your voice.
- lately, he's not been called on, but the things he's wanted to say
  have gotten said by others.  Earlier in Occupy, though, he had lots
  of things where he was the only one who was saying things that he
  felt were important to get said.





* Announcements

** 23rd and Alder: Still there.

** UW's first GA

different from OS's GA, and within 30 minutes, got kicked out by
campus police.  Some (OS members) wanted to sit down and stay there,
but all the students just kind of picked up and went.

Bigger focus on small discussion groups, and just throwing things out
at the same time, when they came back together.

Did get some notes and contacts.  Also planning to start GAs at
Seattle University.

** Moving...

Down-sizing; stuff is available... kitchen stuff, etc.... misc stuff.

* Song

We shall overcome.
-----
