notes/GA/2012-01-10.html

<div id="outline-container-7-1-10" class="outline-4">
<h4 id="sec-7-1-10"><span class="section-number-4">7.1.10</span> more discussion&hellip;</h4>
<div class="outline-text-4" id="text-7-1-10">


<ul>
<li>having a process group was originally not about facilitating, but
  about training people to facilitate, and having others do that.
</li>
<li>That doesn't seem to be the current role of the group, and there's
  the thought that it was a pretty solid idea.
</li>
<li>We as an assembly should probably be more pro-active at volunteering
  to facilitate, and the group should be more active in trying to
  recruit people.  Something that everyone needs to just collectively
  work on.
</li>
<li>Idea that we always have at least two facilitators, and so that one
  of them can always raise their hand, and the other facilitator will
  run the process and get them on stack (even if only at the end)
</li>
<li>The job of facilitation is to move the process along, but the more
  people that you have doing that, the easier it is to have people
  coming to it easily.
</li>
<li>The point about taking someone's voice away &ndash; completely
  understood.  But if everyone has to have a point in time when you
  have to check your voice and <b>don't</b> get to say something&hellip;  Maybe
  that's a useful thing. If more people are open to it and training
  for it, then this will get shared.  We're doing a disservice to some
  of our fellow occupiers by having the same people facilitating every
  night.
</li>
<li>people shouldn't have to choose.  Maybe having more facilitators
  would allow a way for facilitators step up and be speaking.
</li>
<li>There are many people on the team, and people doing agenda,
  time keeper, etc., can speak.  Only two people under the current
  rules can't speak.  But if we amend things so that they can take
  turns, then nobody's voice is unheard.
</li>
<li>One potential problem with the current system is that if you're fine
  with not saying anything one night, but then something comes up in
  the meeting that is highly relevant, then you might want to speak,
  when you'd been fine with facilitating and not speaking previously.
</li>
<li>doesn't always come, wouldn't want to facilitate on the few days
  they do come, because they specifically want to participate in
  something that day.
</li>
<li>so just come more often.  :)
</li>
<li>The point about checking your ego the night you facilitate: there's
  a positive there &ndash; you trust the group enough that even on an issue
  that you care a lot about, that there would be someone there who
  would represent your desires, your philosophy, your interest, in
  balance, ideally, with the multitude of other interests.
</li>
<li>can't honestly see any reason why the facilitators shouldn't be able
  to speak.
</li>
<li>If you're a person who is marginalized, you can't necessarily trust
  that someone will voice what you want to bring up.
</li>
<li>One purpose for keeping people from speaking is to minimize bias in
  who gets to speak.
</li>
<li>there's also a need to recognize that there is an issue of
  capacity.  We have high expectations on the level of commitment for
  most people.  8 GAs a week is a really high level of participation
  &ndash; even those who are highly committed, that's just really hard.
  Perhaps too we need to re-consider the number of meetings that we
  have every week.
</li>
<li>Response to "trusting the assembly"&hellip;  This is one of the few times
  he's been able to say this: He looks around the room and doesn't see
  anyone who he strongly distrusts, but usually there are&hellip; there are
  people within the group who he really distrusts and doesn't want to
  have them be representing him.  Or even for the people that he does
  trust to truly represent him.  Everyone has unique experiences;
  everyone has a unique role within this movement; etc.  If we're
  talking about something, say, that has to do with police, and one
  person has a different perspective because they just got pepper
  sprayed, or has other history, or whatever, it would be unfortunate
  not just for that person, but for all of us.  There's something to
  be said for trusting people, but he doesn't think trust should ever
  mean that you're giving up your voice.
</li>
<li>lately, he's not been called on, but the things he's wanted to say
  have gotten said by others.  Earlier in Occupy, though, he had lots
  of things where he was the only one who was saying things that he
  felt were important to get said.
</li>
</ul>






</div>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Announcements</h2>
<div class="outline-text-2" id="text-8">



</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 23rd and Alder: Still there.</h3>
<div class="outline-text-3" id="text-8-1">


</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> UW's first GA</h3>
<div class="outline-text-3" id="text-8-2">


<p>
different from OS's GA, and within 30 minutes, got kicked out by
campus police.  Some (OS members) wanted to sit down and stay there,
but all the students just kind of picked up and went.
</p>
<p>
Bigger focus on small discussion groups, and just throwing things out
at the same time, when they came back together.
</p>
<p>
Did get some notes and contacts.  Also planning to start GAs at
Seattle University.
</p>
</div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Moving&hellip;</h3>
<div class="outline-text-3" id="text-8-3">


<p>
Down-sizing; stuff is available&hellip; kitchen stuff, etc&hellip;. misc stuff.
</p>
</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Song</h2>
<div class="outline-text-2" id="text-9">


<p>
We shall overcome.

</p>
<hr/>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-01-10 21:39:53 PST</p>
<p class="author">Author: David Lindes</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
